tap "altinity/clickhouse"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# YAML Parser
brew "libyaml"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Collection of portable C++ source libraries
brew "boost"
# Atmel AVR MCU programmer
brew "avrdude"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Free analytics DBMS for big data with SQL interface
brew "clickhouse@22.6", link: true
# Tool for exploring each layer in a docker image
brew "dive"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Fast linters runner for Go
brew "golangci-lint"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Kubernetes package manager
brew "helm@2"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Development kit for the Java programming language
brew "openjdk"
# Centralized server for distributed coordination of services
brew "zookeeper"
# Open-source distributed event streaming platform
brew "kafka"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli@1.22"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Flux CLI
brew "fluxcd/tap/flux"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tools for building Android applications
cask "android-studio"
# Two-factor authentication software
cask "authy"
# Collaboration tool with multi-user screen sharing
cask "coscreen"
# App to build and share containerized applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Open-source keystroke visualizer
cask "keycastr"
# Finds, learns and remembers keyboard shortcuts
cask "keycue"
# Clipboard manager
cask "maccy"
# Markdown editor
cask "mark-text"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# HTTP debugging proxy
cask "proxyman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Management tool for Unity
cask "unity-hub"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
