tap "altinity/clickhouse"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Tool for exploring each layer in a docker image
brew "dive"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Kubernetes package manager
brew "helm@2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Kubernetes command-line interface
brew "kubernetes-cli@1.22"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Free analytics DBMS for big data with SQL interface
brew "altinity/clickhouse/clickhouse@22.6", link: true
# Flux CLI
brew "fluxcd/tap/flux"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Tools for building Android applications
cask "android-studio"
# App to build and share containerized applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Finds, learns and remembers keyboard shortcuts
cask "keycue"
# Clipboard manager
cask "maccy"
# Simple and elegant markdown editor
cask "mark-text"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Multimedia player
cask "vlc"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
